core/src/main/resources/order_template/saam_deletepcrf_element.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <saamint:updateService xmlns:saamint="http://nsn.com/npm/SoapProvisioningInterface/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         <saamint:request>
            <saamint:service>
               <saamint:attributes>
                  <saamint:attribute xsi:type="saamint:singlevalue" saamint:name="identifier" saamint:identifying="true">
                     <saamint:value xsi:type="xsd:string" xmlns:xsd="http://www.w3.org/2001/XMLSchema">{1}</saamint:value>
                  </saamint:attribute>
                  <saamint:attribute xsi:type="saamint:singlevalue" saamint:name="imsi">
                     <saamint:value xsi:type="xsd:string" xmlns:xsd="http://www.w3.org/2001/XMLSchema">{1}</saamint:value>
                  </saamint:attribute>
                  <saamint:attribute xsi:type="saamint:singlevalue" saamint:name="msisdn">
                     <saamint:value xsi:type="xsd:string" xmlns:xsd="http://www.w3.org/2001/XMLSchema">{0}</saamint:value>
                  </saamint:attribute>
               
                  <saamint:attribute xsi:type="saamint:multivalue" saamint:name="pcsServiceList">
                     <saamint:values>
                        <saamint:anyType xsi:type="saamint:struct" saamint:operation="delete">
                           <saamint:attributes>
                              <saamint:attribute xsi:type="saamint:singlevalue" saamint:name="serviceId">
                                 <saamint:value xsi:type="xsd:long" xmlns:xsd="http://www.w3.org/2001/XMLSchema">{2}</saamint:value>
                              </saamint:attribute>
                           </saamint:attributes>
                        </saamint:anyType>
                     </saamint:values>
                  </saamint:attribute>                  
               </saamint:attributes>
               <saamint:serviceIdentifier>
                  <saamint:serviceCode>CFS_PCS5000_INSTANCE</saamint:serviceCode>
               </saamint:serviceIdentifier>
            </saamint:service>
         </saamint:request>
      </saamint:updateService>
   </soapenv:Body>
</soapenv:Envelope>